[Killed] BlockStatement
src/helpers/renderWith.js:6:41
 import { Router } from 'react-router-dom';
 import { render } from '@testing-library/react';
 
-function withRouter(component, history) {
-  return (
-    <Router history={ history }>
-      { component }
-    </Router>
-  );
-}
+function withRouter(component, history) {}
 
 export function renderWithRouter(
killedBy: renders learn react link Verifica se existe os elementos principais na tela Home
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "banner"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ObjectLiteral
src/helpers/renderWith.js:18:35
   component,
   {
     initialEntries = ['/'],
-    history = createMemoryHistory({ initialEntries }),
+    history = createMemoryHistory({}),
   } = {},
 ) {

[Killed] BlockStatement
src/helpers/renderWith.js:20:3
     initialEntries = ['/'],
     history = createMemoryHistory({ initialEntries }),
   } = {},
-) {
-  return {
-    ...render(withRouter(component, history)),
-    history,
-  };
-}
+) {}
 
killedBy: renders learn react link Verifica se existe os elementos principais na tela Home
statusReason: TypeError: Cannot destructure property 'history' of '(0 , _renderWith.renderWithRouter)(...)' as it is undefined.

[Killed] ObjectLiteral
src/helpers/renderWith.js:21:10
     history = createMemoryHistory({ initialEntries }),
   } = {},
 ) {
-  return {
-    ...render(withRouter(component, history)),
-    history,
-  };
+  return {};
 }
 
killedBy: renders learn react link Verifica se existe os elementos principais na tela Home
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "banner"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body />
