[Survived] BlockStatement
src/pages/List.jsx:13:19
   const [pokemonList, setPokemonList] = useState([]);
   const { globalState, setGlobalState } = useContext(Context);
 
-  useEffect(() => {
-    const localStorage = getLocalStorage('favorites');
-    if (!localStorage) saveLocalStorage('favorites', []);
-    setGlobalState({ favorites: localStorage});
-    const getData = async () => {
-      const allPokemon = await fetchAllPokemon();
-      const { results } = allPokemon;
-      const arrayPokemon = await Promise.all(results.map(async (result) => {
-        const eachPokemon = await fetchPokemon(result.name);
-        const { dream_world: { front_default }} = eachPokemon.sprites.other;
-        return {
-          ...result,
-          sprite: front_default,
-        }
-      }));
-      setPokemonList(arrayPokemon);
-    };
-  
-    getData();
-  }, []);
+  useEffect(() => {}, []);
 
   const setFavorites = ({ value, alt }) => {

[Survived] StringLiteral
src/pages/List.jsx:14:42
   const { globalState, setGlobalState } = useContext(Context);
 
   useEffect(() => {
-    const localStorage = getLocalStorage('favorites');
+    const localStorage = getLocalStorage("");
     if (!localStorage) saveLocalStorage('favorites', []);
     setGlobalState({ favorites: localStorage});

[Survived] ConditionalExpression
src/pages/List.jsx:15:9
 
   useEffect(() => {
     const localStorage = getLocalStorage('favorites');
-    if (!localStorage) saveLocalStorage('favorites', []);
+    if (false) saveLocalStorage('favorites', []);
     setGlobalState({ favorites: localStorage});
     const getData = async () => {

[Survived] ConditionalExpression
src/pages/List.jsx:15:9
 
   useEffect(() => {
     const localStorage = getLocalStorage('favorites');
-    if (!localStorage) saveLocalStorage('favorites', []);
+    if (true) saveLocalStorage('favorites', []);
     setGlobalState({ favorites: localStorage});
     const getData = async () => {

[Survived] BlockStatement
src/pages/List.jsx:17:33
     const localStorage = getLocalStorage('favorites');
     if (!localStorage) saveLocalStorage('favorites', []);
     setGlobalState({ favorites: localStorage});
-    const getData = async () => {
-      const allPokemon = await fetchAllPokemon();
-      const { results } = allPokemon;
-      const arrayPokemon = await Promise.all(results.map(async (result) => {
-        const eachPokemon = await fetchPokemon(result.name);
-        const { dream_world: { front_default }} = eachPokemon.sprites.other;
-        return {
-          ...result,
-          sprite: front_default,
-        }
-      }));
-      setPokemonList(arrayPokemon);
-    };
+    const getData = async () => {};
   
     getData();

[Survived] BlockStatement
src/pages/List.jsx:20:76
     const getData = async () => {
       const allPokemon = await fetchAllPokemon();
       const { results } = allPokemon;
-      const arrayPokemon = await Promise.all(results.map(async (result) => {
-        const eachPokemon = await fetchPokemon(result.name);
-        const { dream_world: { front_default }} = eachPokemon.sprites.other;
-        return {
-          ...result,
-          sprite: front_default,
-        }
-      }));
+      const arrayPokemon = await Promise.all(results.map(async (result) => {}));
       setPokemonList(arrayPokemon);
     };

[Survived] StringLiteral
src/pages/List.jsx:35:42
   }, []);
 
   const setFavorites = ({ value, alt }) => {
-    const localStorage = getLocalStorage('favorites');
+    const localStorage = getLocalStorage("");
     console.log(value);
     console.log(alt);

[Survived] BlockStatement
src/pages/List.jsx:38:16
     const localStorage = getLocalStorage('favorites');
     console.log(value);
     console.log(alt);
-    if (value) {
-      const boolean = localStorage.some((pokemon) => pokemon.name === value);
-      if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== value);
-        saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
-        global.alert('Favorito removido com sucesso!');
-       } else { 
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === value), ...localStorage]
-        saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
-        global.alert('Favorito salvo com sucesso!');
-      }
-    } else {
+    if (value) {} else {
       const pokemonName = alt?.split(' ');
       const pokeAlt = pokemonName?.pop();

[Survived] EqualityOperator
src/pages/List.jsx:39:54
     console.log(value);
     console.log(alt);
     if (value) {
-      const boolean = localStorage.some((pokemon) => pokemon.name === value);
+      const boolean = localStorage.some((pokemon) => pokemon.name !== value);
       if (boolean) {
         const array = localStorage.filter((pokemon) => pokemon.name !== value);

[Survived] ConditionalExpression
src/pages/List.jsx:40:11
     console.log(alt);
     if (value) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
-      if (boolean) {
+      if (false) {
         const array = localStorage.filter((pokemon) => pokemon.name !== value);
         saveLocalStorage('favorites', array);

[Survived] EqualityOperator
src/pages/List.jsx:41:56
     if (value) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
       if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== value);
+        const array = localStorage.filter((pokemon) => pokemon.name === value);
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] ArrowFunction
src/pages/List.jsx:41:43
     if (value) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
       if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== value);
+        const array = localStorage.filter(() => undefined);
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] BlockStatement
src/pages/List.jsx:45:15
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});
         global.alert('Favorito removido com sucesso!');
-       } else { 
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === value), ...localStorage]
-        saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
-        global.alert('Favorito salvo com sucesso!');
-      }
+       } else {}
     } else {
       const pokemonName = alt?.split(' ');

[Survived] EqualityOperator
src/pages/List.jsx:46:59
         setGlobalState({ favorites: array});
         global.alert('Favorito removido com sucesso!');
        } else { 
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === value), ...localStorage]
+        const array = [...pokemonList.filter((pokemon) => pokemon.name !== value), ...localStorage]
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] ConditionalExpression
src/pages/List.jsx:46:59
         setGlobalState({ favorites: array});
         global.alert('Favorito removido com sucesso!');
        } else { 
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === value), ...localStorage]
+        const array = [...pokemonList.filter((pokemon) => false), ...localStorage]
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] StringLiteral
src/pages/List.jsx:47:26
         global.alert('Favorito removido com sucesso!');
        } else { 
         const array = [...pokemonList.filter((pokemon) => pokemon.name === value), ...localStorage]
-        saveLocalStorage('favorites', array);
+        saveLocalStorage("", array);
         setGlobalState({ favorites: array});
         global.alert('Favorito salvo com sucesso!');

[Survived] StringLiteral
src/pages/List.jsx:49:22
         const array = [...pokemonList.filter((pokemon) => pokemon.name === value), ...localStorage]
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});
-        global.alert('Favorito salvo com sucesso!');
+        global.alert("");
       }
     } else {

[Survived] BlockStatement
src/pages/List.jsx:51:12
         setGlobalState({ favorites: array});
         global.alert('Favorito salvo com sucesso!');
       }
-    } else {
-      const pokemonName = alt?.split(' ');
-      const pokeAlt = pokemonName?.pop();
-      const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
-      if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);
-        saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
-        global.alert('Favorito removido com sucesso!');
-      } else {
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === pokeAlt), ...localStorage];
-        saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
-        global.alert('Favorito salvo com sucesso!');
-      }
-    }
+    } else {}
   }
   return (

[Survived] OptionalChaining
src/pages/List.jsx:52:27
         global.alert('Favorito salvo com sucesso!');
       }
     } else {
-      const pokemonName = alt?.split(' ');
+      const pokemonName = alt.split(' ');
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);

[Survived] OptionalChaining
src/pages/List.jsx:53:23
       }
     } else {
       const pokemonName = alt?.split(' ');
-      const pokeAlt = pokemonName?.pop();
+      const pokeAlt = pokemonName.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {

[Survived] EqualityOperator
src/pages/List.jsx:54:54
     } else {
       const pokemonName = alt?.split(' ');
       const pokeAlt = pokemonName?.pop();
-      const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
+      const boolean = localStorage.some((pokemon) => pokemon.name !== pokeAlt);
       if (boolean) {
         const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);

[Survived] ConditionalExpression
src/pages/List.jsx:54:54
     } else {
       const pokemonName = alt?.split(' ');
       const pokeAlt = pokemonName?.pop();
-      const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
+      const boolean = localStorage.some((pokemon) => false);
       if (boolean) {
         const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);

[Survived] BlockStatement
src/pages/List.jsx:55:20
       const pokemonName = alt?.split(' ');
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
-      if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);
-        saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
-        global.alert('Favorito removido com sucesso!');
-      } else {
+      if (boolean) {} else {
         const array = [...pokemonList.filter((pokemon) => pokemon.name === pokeAlt), ...localStorage];
         saveLocalStorage('favorites', array);

[Survived] EqualityOperator
src/pages/List.jsx:56:56
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);
+        const array = localStorage.filter((pokemon) => pokemon.name === pokeAlt);
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] ConditionalExpression
src/pages/List.jsx:56:56
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);
+        const array = localStorage.filter((pokemon) => true);
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] StringLiteral
src/pages/List.jsx:57:26
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {
         const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);
-        saveLocalStorage('favorites', array);
+        saveLocalStorage("", array);
         setGlobalState({ favorites: array});
         global.alert('Favorito removido com sucesso!');

[Survived] ObjectLiteral
src/pages/List.jsx:58:24
       if (boolean) {
         const array = localStorage.filter((pokemon) => pokemon.name !== pokeAlt);
         saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
+        setGlobalState({});
         global.alert('Favorito removido com sucesso!');
       } else {

[Survived] BlockStatement
src/pages/List.jsx:60:14
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});
         global.alert('Favorito removido com sucesso!');
-      } else {
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === pokeAlt), ...localStorage];
-        saveLocalStorage('favorites', array);
-        setGlobalState({ favorites: array});
-        global.alert('Favorito salvo com sucesso!');
-      }
+      } else {}
     }
   }

[Survived] ArrowFunction
src/pages/List.jsx:61:46
         setGlobalState({ favorites: array});
         global.alert('Favorito removido com sucesso!');
       } else {
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === pokeAlt), ...localStorage];
+        const array = [...pokemonList.filter(() => undefined), ...localStorage];
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] EqualityOperator
src/pages/List.jsx:61:59
         setGlobalState({ favorites: array});
         global.alert('Favorito removido com sucesso!');
       } else {
-        const array = [...pokemonList.filter((pokemon) => pokemon.name === pokeAlt), ...localStorage];
+        const array = [...pokemonList.filter((pokemon) => pokemon.name !== pokeAlt), ...localStorage];
         saveLocalStorage('favorites', array);
         setGlobalState({ favorites: array});

[Survived] StringLiteral
src/pages/List.jsx:62:26
         global.alert('Favorito removido com sucesso!');
       } else {
         const array = [...pokemonList.filter((pokemon) => pokemon.name === pokeAlt), ...localStorage];
-        saveLocalStorage('favorites', array);
+        saveLocalStorage("", array);
         setGlobalState({ favorites: array});
         global.alert('Favorito salvo com sucesso!');

[Survived] ArrowFunction
src/pages/List.jsx:74:25
         <h2 id="heading-list">Lista</h2>
         <Link id="linkToHome" to="/">Back to Home</Link>
       </header>
-      {pokemonList?.map((pokemon) => (
-        <div className="pokemon-card" key={pokemon.name}>
-          <img className="pokemon-images" src={pokemon.sprite} alt={pokemon.name} />
-          <h1>{pokemon.name}</h1>
-          <button 
-            value={pokemon.name} 
-            onClick={ ({target}) => {
-              const localStorage = getLocalStorage('favorites');
-              if (!localStorage) saveLocalStorage('favorites', []);
-              setFavorites(target);
-            } }
-          >
-            <img
-              src={ globalState.favorites?.some((favorite) => favorite.name === pokemon.name) ? blackHeart : whiteHeart } 
-              alt={`Botão de favoritar do ${pokemon.name}`}/>
-            Favoritar
-          </button>
-        </div>
-      ))}
+      {pokemonList?.map(() => undefined)}
       <div className="favorites-list">
         {globalState.favorites?.map((pokemon) => (

[Survived] BlockStatement
src/pages/List.jsx:80:37
           <h1>{pokemon.name}</h1>
           <button 
             value={pokemon.name} 
-            onClick={ ({target}) => {
-              const localStorage = getLocalStorage('favorites');
-              if (!localStorage) saveLocalStorage('favorites', []);
-              setFavorites(target);
-            } }
+            onClick={ ({target}) => {} }
           >
             <img

[Survived] StringLiteral
src/pages/List.jsx:81:52
           <button 
             value={pokemon.name} 
             onClick={ ({target}) => {
-              const localStorage = getLocalStorage('favorites');
+              const localStorage = getLocalStorage("");
               if (!localStorage) saveLocalStorage('favorites', []);
               setFavorites(target);

[Survived] BooleanLiteral
src/pages/List.jsx:82:19
             value={pokemon.name} 
             onClick={ ({target}) => {
               const localStorage = getLocalStorage('favorites');
-              if (!localStorage) saveLocalStorage('favorites', []);
+              if (localStorage) saveLocalStorage('favorites', []);
               setFavorites(target);
             } }

[Survived] ArrowFunction
src/pages/List.jsx:87:49
             } }
           >
             <img
-              src={ globalState.favorites?.some((favorite) => favorite.name === pokemon.name) ? blackHeart : whiteHeart } 
+              src={ globalState.favorites?.some(() => undefined) ? blackHeart : whiteHeart } 
               alt={`Botão de favoritar do ${pokemon.name}`}/>
             Favoritar

[Survived] ConditionalExpression
src/pages/List.jsx:87:63
             } }
           >
             <img
-              src={ globalState.favorites?.some((favorite) => favorite.name === pokemon.name) ? blackHeart : whiteHeart } 
+              src={ globalState.favorites?.some((favorite) => false) ? blackHeart : whiteHeart } 
               alt={`Botão de favoritar do ${pokemon.name}`}/>
             Favoritar

[Survived] ArrowFunction
src/pages/List.jsx:94:37
         </div>
       ))}
       <div className="favorites-list">
-        {globalState.favorites?.map((pokemon) => (
-          <div className="pokemon-card" key={pokemon.name}>
-            <img className="pokemon-images" src={pokemon.sprite} alt={pokemon.name} />
-            <h1>{pokemon.name}</h1>
-            <button value={pokemon.name} onClick={ ({target}) => {
-              const localStorage = getLocalStorage('favorites');
-              if (!localStorage) saveLocalStorage('favorites', []);
-              setFavorites(target);
-            } }>Desfavoritar</button>
-          </div>
-        ))}
+        {globalState.favorites?.map(() => undefined)}
       </div>
     </div>

[Survived] BlockStatement
src/pages/List.jsx:98:66
           <div className="pokemon-card" key={pokemon.name}>
             <img className="pokemon-images" src={pokemon.sprite} alt={pokemon.name} />
             <h1>{pokemon.name}</h1>
-            <button value={pokemon.name} onClick={ ({target}) => {
-              const localStorage = getLocalStorage('favorites');
-              if (!localStorage) saveLocalStorage('favorites', []);
-              setFavorites(target);
-            } }>Desfavoritar</button>
+            <button value={pokemon.name} onClick={ ({target}) => {} }>Desfavoritar</button>
           </div>
         ))}
