[Killed] ArrowFunction
src/helpers/api.js:1:93
-export const fetchAllPokemon = async () => fetch('https://pokeapi.co/api/v2/pokemon/').then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
+export const fetchAllPokemon = async () => fetch('https://pokeapi.co/api/v2/pokemon/').then(() => undefined).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
 
 export const fetchPokemon = async (pokemon) => fetch(`https://pokeapi.co/api/v2/pokemon/${pokemon}`).then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: TypeError: Cannot destructure property 'results' of 'allPokemon' as it is undefined.

[Killed] ArrowFunction
src/helpers/api.js:1:115
-export const fetchAllPokemon = async () => fetch('https://pokeapi.co/api/v2/pokemon/').then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
+export const fetchAllPokemon = async () => fetch('https://pokeapi.co/api/v2/pokemon/').then((d) => d.json()).then(() => undefined).catch((err) => console.log('A api retornou o erro: ' + err));
 
 export const fetchPokemon = async (pokemon) => fetch(`https://pokeapi.co/api/v2/pokemon/${pokemon}`).then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: TypeError: Cannot destructure property 'results' of 'allPokemon' as it is undefined.

[Killed] ArrowFunction
src/helpers/api.js:3:107
 export const fetchAllPokemon = async () => fetch('https://pokeapi.co/api/v2/pokemon/').then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
 
-export const fetchPokemon = async (pokemon) => fetch(`https://pokeapi.co/api/v2/pokemon/${pokemon}`).then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
+export const fetchPokemon = async (pokemon) => fetch(`https://pokeapi.co/api/v2/pokemon/${pokemon}`).then(() => undefined).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: TypeError: Cannot read properties of undefined (reading 'sprites')

[Killed] ArrowFunction
src/helpers/api.js:3:29
 export const fetchAllPokemon = async () => fetch('https://pokeapi.co/api/v2/pokemon/').then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
 
-export const fetchPokemon = async (pokemon) => fetch(`https://pokeapi.co/api/v2/pokemon/${pokemon}`).then((d) => d.json()).then((r) => r).catch((err) => console.log('A api retornou o erro: ' + err));
+export const fetchPokemon = () => undefined;
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: TypeError: Cannot read properties of undefined (reading 'sprites')
