[Killed] BlockStatement
src/context/Provider.js:5:48
 import React, { useMemo, useState } from 'react';
 import Context from './Context';
 
-export default function Provider({ children }) {
-  const stateDefault = {
-    favorites: [''],
-  };
-  const [globalState, setGlobalState] = useState(stateDefault);
-
-  const context = useMemo(() => ({
-    globalState,
-    setGlobalState,
-  }), [globalState, setGlobalState]);
-  
-  return (
-    <Context.Provider value={ context }>
-      { children }
-    </Context.Provider>
-  )
-}
+export default function Provider({ children }) {}
 
 Provider.propTypes = {
killedBy: renders learn react link Verifica se existe os elementos principais na tela Home
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "banner"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Survived] ObjectLiteral
src/context/Provider.js:6:24
 import Context from './Context';
 
 export default function Provider({ children }) {
-  const stateDefault = {
-    favorites: [''],
-  };
+  const stateDefault = {};
   const [globalState, setGlobalState] = useState(stateDefault);
 

[Survived] StringLiteral
src/context/Provider.js:7:17
 
 export default function Provider({ children }) {
   const stateDefault = {
-    favorites: [''],
+    favorites: ["Stryker was here!"],
   };
   const [globalState, setGlobalState] = useState(stateDefault);

[Survived] ArrayDeclaration
src/context/Provider.js:7:16
 
 export default function Provider({ children }) {
   const stateDefault = {
-    favorites: [''],
+    favorites: [],
   };
   const [globalState, setGlobalState] = useState(stateDefault);

[Killed] ArrowFunction
src/context/Provider.js:11:27
   };
   const [globalState, setGlobalState] = useState(stateDefault);
 
-  const context = useMemo(() => ({
-    globalState,
-    setGlobalState,
-  }), [globalState, setGlobalState]);
+  const context = useMemo(() => undefined, [globalState, setGlobalState]);
   
   return (
killedBy: renders learn react link Verifica se existe a imagem correta e o link com redirecionamento correto na tela Home
statusReason: TypeError: Cannot destructure property 'globalState' of '(0 , _react.useContext)(...)' as it is undefined.

[Killed] ObjectLiteral
src/context/Provider.js:11:34
   };
   const [globalState, setGlobalState] = useState(stateDefault);
 
-  const context = useMemo(() => ({
-    globalState,
-    setGlobalState,
-  }), [globalState, setGlobalState]);
+  const context = useMemo(() => ({}), [globalState, setGlobalState]);
   
   return (
killedBy: renders learn react link Verifica se existe a imagem correta e o link com redirecionamento correto na tela Home
statusReason: TypeError: Cannot read properties of undefined (reading 'favorites')
