[Killed] BlockStatement
src/App.js:8:16
 import List from './pages/List';
 import Provider from './context/Provider';
 
-function App() {
-  return (
-    <Provider>
-      <Switch>
-        <Route exact path="/" component={ Home } />
-        <Route exact path="/list" component={ List } />
-      </Switch>
-    </Provider>
-  );
-}
+function App() {}
 
 export default App;
killedBy: renders learn react link Verifica se existe os elementos principais na tela Home
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "banner"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>
