[Survived] ArrowFunction
src/helpers/storage.js:1:32
-export const getLocalStorage = (key) => JSON.parse(localStorage.getItem(key));
+export const getLocalStorage = () => undefined;
 
 export const saveLocalStorage = (key, object) => {

[Survived] BlockStatement
src/helpers/storage.js:3:50
 export const getLocalStorage = (key) => JSON.parse(localStorage.getItem(key));
 
-export const saveLocalStorage = (key, object) => {
-  localStorage.setItem(key, JSON.stringify(object));
-};
+export const saveLocalStorage = (key, object) => {};
 
