[Killed] BlockStatement
src/pages/Home.jsx:6:32
 import { useHistory } from 'react-router';
 import { Link } from 'react-router-dom';
 
-export default function Home() {
-  const appDescription = "Esse app tem como objetivo renderizar uma lista de pokémon e poder interagir com ela, adicionando cada pokémon aos seus favoritos ou removê-los da sua lista."
-  const history = useHistory();
-  return (
-    <div className="hero-home">
-
-      <header className='header-home'>Home</header>
-
-      <section className="welcome-home">
-        <h1 id="welcomeHeading">Bem Vindo ao App Teste com tema do Pokémon!</h1>
-        <img id="pokemonLogo" src={ pokemonLogo } alt="logo pokémon" />
-        <h3 id="appDescription">{ appDescription }</h3>
-      </section>
-
-      <section className="button-home">
-        <span>Clique no botão ou no Link para começar sua experiência!</span>
-        <button type="button" onClick={ () => history.push('/list') }>Pokémon</button>
-        <Link to="/list">Pokémon</Link>
-      </section>
-
-    </div>
-  );
-}
+export default function Home() {}
 
killedBy: renders learn react link Verifica se existe os elementos principais na tela Home
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "banner"

There are no accessible roles. But there might be some inaccessible roles. If you wish to access them, then set the `hidden` option to `true`. Learn more about this here: https://testing-library.com/docs/dom-testing-library/api-queries#byrole

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] StringLiteral
src/pages/Home.jsx:7:26
 import { Link } from 'react-router-dom';
 
 export default function Home() {
-  const appDescription = "Esse app tem como objetivo renderizar uma lista de pokémon e poder interagir com ela, adicionando cada pokémon aos seus favoritos ou removê-los da sua lista."
+  const appDescription = ""
   const history = useHistory();
   return (
killedBy: renders learn react link Verifica se existe os elementos principais na tela Home
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "heading" and name `/esse app tem como objetivo renderizar uma lista de pokémon e poder interagir com ela, adicionando cada pokémon aos seus favoritos ou removê-los da sua lista\./i`

Here are the accessible roles:

  banner:

  Name "":
  <header

[Survived] ArrowFunction
src/pages/Home.jsx:22:41
 
       <section className="button-home">
         <span>Clique no botão ou no Link para começar sua experiência!</span>
-        <button type="button" onClick={ () => history.push('/list') }>Pokémon</button>
+        <button type="button" onClick={ () => undefined }>Pokémon</button>
         <Link to="/list">Pokémon</Link>
       </section>
