[Killed] BlockStatement
src/pages/List.jsx:13:19
   const [pokemonList, setPokemonList] = useState([]);
   const { globalState, setGlobalState } = useContext(Context);
 
-  useEffect(() => {
-    const localStorage = getLocalStorage("favorites");
-    if (!localStorage) saveLocalStorage("favorites", []);
-    setGlobalState({ favorites: localStorage });
-    const getData = async () => {
-      const allPokemon = await fetchAllPokemon();
-      const { results } = allPokemon;
-      const arrayPokemon = await Promise.all(
-        results.map(async (result) => {
-          const eachPokemon = await fetchPokemon(result.name);
-          const {
-            dream_world: { front_default },
-          } = eachPokemon.sprites.other;
-          return {
-            ...result,
-            sprite: front_default,
-          };
-        })
-      );
-      setPokemonList(arrayPokemon);
-    };
-
-    getData();
-  }, []);
+  useEffect(() => {}, []);
 
   const setFavorites = ({ value, alt }) => {
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] StringLiteral
src/pages/List.jsx:14:42
   const { globalState, setGlobalState } = useContext(Context);
 
   useEffect(() => {
-    const localStorage = getLocalStorage("favorites");
+    const localStorage = getLocalStorage("");
     if (!localStorage) saveLocalStorage("favorites", []);
     setGlobalState({ favorites: localStorage });

[Killed] ConditionalExpression
src/pages/List.jsx:15:9
 
   useEffect(() => {
     const localStorage = getLocalStorage("favorites");
-    if (!localStorage) saveLocalStorage("favorites", []);
+    if (false) saveLocalStorage("favorites", []);
     setGlobalState({ favorites: localStorage });
     const getData = async () => {
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] ConditionalExpression
src/pages/List.jsx:15:9
 
   useEffect(() => {
     const localStorage = getLocalStorage("favorites");
-    if (!localStorage) saveLocalStorage("favorites", []);
+    if (true) saveLocalStorage("favorites", []);
     setGlobalState({ favorites: localStorage });
     const getData = async () => {
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] BlockStatement
src/pages/List.jsx:17:33
     const localStorage = getLocalStorage("favorites");
     if (!localStorage) saveLocalStorage("favorites", []);
     setGlobalState({ favorites: localStorage });
-    const getData = async () => {
-      const allPokemon = await fetchAllPokemon();
-      const { results } = allPokemon;
-      const arrayPokemon = await Promise.all(
-        results.map(async (result) => {
-          const eachPokemon = await fetchPokemon(result.name);
-          const {
-            dream_world: { front_default },
-          } = eachPokemon.sprites.other;
-          return {
-            ...result,
-            sprite: front_default,
-          };
-        })
-      );
-      setPokemonList(arrayPokemon);
-    };
+    const getData = async () => {};
 
     getData();
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] BlockStatement
src/pages/List.jsx:21:39
       const allPokemon = await fetchAllPokemon();
       const { results } = allPokemon;
       const arrayPokemon = await Promise.all(
-        results.map(async (result) => {
-          const eachPokemon = await fetchPokemon(result.name);
-          const {
-            dream_world: { front_default },
-          } = eachPokemon.sprites.other;
-          return {
-            ...result,
-            sprite: front_default,
-          };
-        })
+        results.map(async (result) => {})
       );
       setPokemonList(arrayPokemon);
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: TypeError: Cannot read properties of undefined (reading 'sprite')

[Survived] ArrayDeclaration
src/pages/List.jsx:36:6
     };
 
     getData();
-  }, []);
+  }, ["Stryker was here"]);
 
   const setFavorites = ({ value, alt }) => {

[Killed] BlockStatement
src/pages/List.jsx:42:16
     const localStorage = getLocalStorage("favorites");
     console.log(value);
     console.log(alt);
-    if (value) {
-      const boolean = localStorage.some((pokemon) => pokemon.name === value);
-      if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== value);
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito removido com sucesso!");
-      } else {
-        const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === value),
-          ...localStorage,
-        ];
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito salvo com sucesso!");
-      }
-    } else {
+    if (value) {} else {
       const pokemonName = alt?.split(" ");
       const pokeAlt = pokemonName?.pop();
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] ConditionalExpression
src/pages/List.jsx:42:9
     const localStorage = getLocalStorage("favorites");
     console.log(value);
     console.log(alt);
-    if (value) {
+    if (false) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
       if (boolean) {

[Killed] MethodExpression
src/pages/List.jsx:43:23
     console.log(value);
     console.log(alt);
     if (value) {
-      const boolean = localStorage.some((pokemon) => pokemon.name === value);
+      const boolean = localStorage.every(pokemon => pokemon.name === value);
       if (boolean) {
         const array = localStorage.filter((pokemon) => pokemon.name !== value);
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] ConditionalExpression
src/pages/List.jsx:43:54
     console.log(value);
     console.log(alt);
     if (value) {
-      const boolean = localStorage.some((pokemon) => pokemon.name === value);
+      const boolean = localStorage.some((pokemon) => true);
       if (boolean) {
         const array = localStorage.filter((pokemon) => pokemon.name !== value);
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] BlockStatement
src/pages/List.jsx:44:20
     console.log(alt);
     if (value) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
-      if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== value);
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito removido com sucesso!");
-      } else {
+      if (boolean) {} else {
         const array = [
           ...pokemonList.filter((pokemon) => pokemon.name === value),

[Survived] ConditionalExpression
src/pages/List.jsx:44:11
     console.log(alt);
     if (value) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
-      if (boolean) {
+      if (true) {
         const array = localStorage.filter((pokemon) => pokemon.name !== value);
         saveLocalStorage("favorites", array);

[Killed] ConditionalExpression
src/pages/List.jsx:45:56
     if (value) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
       if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== value);
+        const array = localStorage.filter((pokemon) => true);
         saveLocalStorage("favorites", array);
         setGlobalState({ favorites: array });
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] ConditionalExpression
src/pages/List.jsx:45:56
     if (value) {
       const boolean = localStorage.some((pokemon) => pokemon.name === value);
       if (boolean) {
-        const array = localStorage.filter((pokemon) => pokemon.name !== value);
+        const array = localStorage.filter((pokemon) => false);
         saveLocalStorage("favorites", array);
         setGlobalState({ favorites: array });
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] StringLiteral
src/pages/List.jsx:48:22
         const array = localStorage.filter((pokemon) => pokemon.name !== value);
         saveLocalStorage("favorites", array);
         setGlobalState({ favorites: array });
-        global.alert("Favorito removido com sucesso!");
+        global.alert("");
       } else {
         const array = [
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] BlockStatement
src/pages/List.jsx:49:14
         saveLocalStorage("favorites", array);
         setGlobalState({ favorites: array });
         global.alert("Favorito removido com sucesso!");
-      } else {
-        const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === value),
-          ...localStorage,
-        ];
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito salvo com sucesso!");
-      }
+      } else {}
     } else {
       const pokemonName = alt?.split(" ");
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] EqualityOperator
src/pages/List.jsx:51:46
         global.alert("Favorito removido com sucesso!");
       } else {
         const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === value),
+          ...pokemonList.filter((pokemon) => pokemon.name !== value),
           ...localStorage,
         ];
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] MethodExpression
src/pages/List.jsx:51:14
         global.alert("Favorito removido com sucesso!");
       } else {
         const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === value),
+          ...pokemonList,
           ...localStorage,
         ];
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] StringLiteral
src/pages/List.jsx:54:26
           ...pokemonList.filter((pokemon) => pokemon.name === value),
           ...localStorage,
         ];
-        saveLocalStorage("favorites", array);
+        saveLocalStorage("", array);
         setGlobalState({ favorites: array });
         global.alert("Favorito salvo com sucesso!");

[Survived] ObjectLiteral
src/pages/List.jsx:55:24
           ...localStorage,
         ];
         saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
+        setGlobalState({});
         global.alert("Favorito salvo com sucesso!");
       }

[Killed] BlockStatement
src/pages/List.jsx:58:12
         setGlobalState({ favorites: array });
         global.alert("Favorito salvo com sucesso!");
       }
-    } else {
-      const pokemonName = alt?.split(" ");
-      const pokeAlt = pokemonName?.pop();
-      const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
-      if (boolean) {
-        const array = localStorage.filter(
-          (pokemon) => pokemon.name !== pokeAlt
-        );
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito removido com sucesso!");
-      } else {
-        const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === pokeAlt),
-          ...localStorage,
-        ];
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito salvo com sucesso!");
-      }
-    }
+    } else {}
   };
   return (
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] OptionalChaining
src/pages/List.jsx:59:27
         global.alert("Favorito salvo com sucesso!");
       }
     } else {
-      const pokemonName = alt?.split(" ");
+      const pokemonName = alt.split(" ");
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] StringLiteral
src/pages/List.jsx:59:38
         global.alert("Favorito salvo com sucesso!");
       }
     } else {
-      const pokemonName = alt?.split(" ");
+      const pokemonName = alt?.split("");
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] OptionalChaining
src/pages/List.jsx:60:23
       }
     } else {
       const pokemonName = alt?.split(" ");
-      const pokeAlt = pokemonName?.pop();
+      const pokeAlt = pokemonName.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {

[Killed] MethodExpression
src/pages/List.jsx:61:23
     } else {
       const pokemonName = alt?.split(" ");
       const pokeAlt = pokemonName?.pop();
-      const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
+      const boolean = localStorage.every(pokemon => pokemon.name === pokeAlt);
       if (boolean) {
         const array = localStorage.filter(
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] ConditionalExpression
src/pages/List.jsx:61:54
     } else {
       const pokemonName = alt?.split(" ");
       const pokeAlt = pokemonName?.pop();
-      const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
+      const boolean = localStorage.some((pokemon) => true);
       if (boolean) {
         const array = localStorage.filter(

[Killed] ConditionalExpression
src/pages/List.jsx:62:11
       const pokemonName = alt?.split(" ");
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
-      if (boolean) {
+      if (true) {
         const array = localStorage.filter(
           (pokemon) => pokemon.name !== pokeAlt
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] BlockStatement
src/pages/List.jsx:62:20
       const pokemonName = alt?.split(" ");
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
-      if (boolean) {
-        const array = localStorage.filter(
-          (pokemon) => pokemon.name !== pokeAlt
-        );
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito removido com sucesso!");
-      } else {
+      if (boolean) {} else {
         const array = [
           ...pokemonList.filter((pokemon) => pokemon.name === pokeAlt),

[Survived] MethodExpression
src/pages/List.jsx:63:23
       const pokeAlt = pokemonName?.pop();
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {
-        const array = localStorage.filter(
-          (pokemon) => pokemon.name !== pokeAlt
-        );
+        const array = localStorage;
         saveLocalStorage("favorites", array);
         setGlobalState({ favorites: array });

[Killed] ConditionalExpression
src/pages/List.jsx:64:24
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {
         const array = localStorage.filter(
-          (pokemon) => pokemon.name !== pokeAlt
+          (pokemon) => true
         );
         saveLocalStorage("favorites", array);
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] ConditionalExpression
src/pages/List.jsx:64:24
       const boolean = localStorage.some((pokemon) => pokemon.name === pokeAlt);
       if (boolean) {
         const array = localStorage.filter(
-          (pokemon) => pokemon.name !== pokeAlt
+          (pokemon) => false
         );
         saveLocalStorage("favorites", array);
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] StringLiteral
src/pages/List.jsx:66:26
         const array = localStorage.filter(
           (pokemon) => pokemon.name !== pokeAlt
         );
-        saveLocalStorage("favorites", array);
+        saveLocalStorage("", array);
         setGlobalState({ favorites: array });
         global.alert("Favorito removido com sucesso!");
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] BlockStatement
src/pages/List.jsx:69:14
         saveLocalStorage("favorites", array);
         setGlobalState({ favorites: array });
         global.alert("Favorito removido com sucesso!");
-      } else {
-        const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === pokeAlt),
-          ...localStorage,
-        ];
-        saveLocalStorage("favorites", array);
-        setGlobalState({ favorites: array });
-        global.alert("Favorito salvo com sucesso!");
-      }
+      } else {}
     }
   };
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] ConditionalExpression
src/pages/List.jsx:71:46
         global.alert("Favorito removido com sucesso!");
       } else {
         const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === pokeAlt),
+          ...pokemonList.filter((pokemon) => false),
           ...localStorage,
         ];
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] MethodExpression
src/pages/List.jsx:71:14
         global.alert("Favorito removido com sucesso!");
       } else {
         const array = [
-          ...pokemonList.filter((pokemon) => pokemon.name === pokeAlt),
+          ...pokemonList,
           ...localStorage,
         ];

[Survived] OptionalChaining
src/pages/List.jsx:88:8
           Back to Home
         </Link>
       </header>
-      {pokemonList?.map((pokemon) => (
+      {pokemonList.map((pokemon) => (
         <div
           className="pokemon-card"

[Survived] BlockStatement
src/pages/List.jsx:102:38
           <h1>{pokemon.name}</h1>
           <button
             value={pokemon.name}
-            onClick={({ target }) => {
-              const localStorage = getLocalStorage("favorites");
-              if (!localStorage) saveLocalStorage("favorites", []);
-              setFavorites(target);
-            }}
+            onClick={({ target }) => {}}
           >
             <img

[Survived] StringLiteral
src/pages/List.jsx:103:52
           <button
             value={pokemon.name}
             onClick={({ target }) => {
-              const localStorage = getLocalStorage("favorites");
+              const localStorage = getLocalStorage("");
               if (!localStorage) saveLocalStorage("favorites", []);
               setFavorites(target);

[Survived] BooleanLiteral
src/pages/List.jsx:104:19
             value={pokemon.name}
             onClick={({ target }) => {
               const localStorage = getLocalStorage("favorites");
-              if (!localStorage) saveLocalStorage("favorites", []);
+              if (localStorage) saveLocalStorage("favorites", []);
               setFavorites(target);
             }}

[Killed] OptionalChaining
src/pages/List.jsx:110:17
           >
             <img
               src={
-                globalState.favorites?.some(
+                globalState.favorites.some(
                   (favorite) => favorite.name === pokemon.name
                 )
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] MethodExpression
src/pages/List.jsx:110:17
           >
             <img
               src={
-                globalState.favorites?.some(
-                  (favorite) => favorite.name === pokemon.name
-                )
+                globalState.favorites?.every(favorite => favorite.name === pokemon.name)
                   ? blackHeart
                   : whiteHeart
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] ArrowFunction
src/pages/List.jsx:111:19
             <img
               src={
                 globalState.favorites?.some(
-                  (favorite) => favorite.name === pokemon.name
+                  () => undefined
                 )
                   ? blackHeart
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] ConditionalExpression
src/pages/List.jsx:111:33
             <img
               src={
                 globalState.favorites?.some(
-                  (favorite) => favorite.name === pokemon.name
+                  (favorite) => true
                 )
                   ? blackHeart
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Survived] StringLiteral
src/pages/List.jsx:116:20
                   ? blackHeart
                   : whiteHeart
               }
-              alt={`Botão de favoritar do ${pokemon.name}`}
+              alt={``}
             />
             Favoritar

[Killed] ArrowFunction
src/pages/List.jsx:123:37
         </div>
       ))}
       <div className="favorites-list">
-        {globalState.favorites?.map((pokemon) => (
-          <div
-            className="pokemon-card"
-            data-testid="card-pokemon-favorites"
-            key={pokemon.name}
-          >
-            <img
-              className="pokemon-images"
-              src={pokemon.sprite}
-              alt={pokemon.name}
-            />
-            <h1>{pokemon.name}</h1>
-            <button
-              value={pokemon.name}
-              onClick={({ target }) => {
-                const localStorage = getLocalStorage("favorites");
-                if (!localStorage) saveLocalStorage("favorites", []);
-                setFavorites(target);
-              }}
-            >
-              Desfavoritar
-            </button>
-          </div>
-        ))}
+        {globalState.favorites?.map(() => undefined)}
       </div>
     </div>
killedBy: renders learn react link Verifica os elementos principais na tela List
statusReason: Error: Unable to find an element by: [data-testid="card-pokemon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="hero-list"
    >

[Killed] OptionalChaining
src/pages/List.jsx:123:10
         </div>
       ))}
       <div className="favorites-list">
-        {globalState.favorites?.map((pokemon) => (
+        {globalState.favorites.map((pokemon) => (
           <div
             className="pokemon-card"
killedBy: renders learn react link Verifica se existe a imagem correta e o link com redirecionamento correto na tela Home
statusReason: TypeError: Cannot read properties of null (reading 'map')
